WhiteBalance2800K/esp32ai/firmware/src/main.cpp
// ESP32-C3 / ESP8266 AI clock: shows live Claude Code / Codex CLI
// working status and usage quota, polled from a small bridge service that
// runs on the developer's Mac (see ../bridge/bridge.py).
//
// Display: 240x240 SPI ST7789 (TFT_eSPI). Pin mapping is set via build_flags
// in platformio.ini - edit those if your wiring differs.

#include <Arduino.h>
#if defined(ESP32)
#include <WiFi.h>
#include <WebServer.h>
#include <HTTPClient.h>
#include <esp_arduino_version.h>
#else
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#endif
#include <WiFiClient.h>
#include <WiFiManager.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <SPI.h>
#include <TFT_eSPI.h>
#include <AnimatedGIF.h>

#if defined(CONFIG_IDF_TARGET_ESP32C3)
static_assert(REG_SPI_BASE(SPI2_HOST) == DR_REG_SPI2_BASE,
              "ESP32-C3 SPI2 register mapping is incompatible with TFT_eSPI");
static_assert(TFT_SCLK == 3 && TFT_MOSI == 5 && TFT_MISO == 5 && TFT_DC == 2 && TFT_RST == 6 &&
                  TFT_BL == 1 && TFT_CS == -1,
              "ESP32-C3 display pins no longer match the recovered factory firmware");
#endif

#include "config.h"
#include "setup_font_zh.h"
#include "img/claude_sprite.h"
#include "img/codex_sprite.h"
#include "img/border_collie_sprite.h"
#include "img/claude_logo.h"
#include "img/codex_logo.h"

TFT_eSPI tft = TFT_eSPI();
#if defined(ESP32)
WebServer webServer(80);
#else
ESP8266WebServer webServer(80);
#endif

// ---------- custom sprite storage (LittleFS) ----------
// Custom uploads replace the compiled-in default animation without needing a
// firmware rebuild. You POST a raw .gif straight to /sprite/claude or
// /sprite/codex (the device serves its own upload page at "/"); the ESP8266
// decodes and rescales the GIF *on-device* (AnimatedGIF, line-by-line so it
// never needs a full-canvas buffer) into the wire format below, which the
// display path then reads back frame-by-frame:
//   [1 byte frame count][frame0 bytes][frame1 bytes]...
// Each frame is exactly CLAUDE_SPRITE_W x H (or CODEX_SPRITE_W x H) RGB565
// pixels, byte order matching tools/convert_sprites.py's to_rgb565() so the
// compiled-in defaults and custom uploads share one draw path.
const char *CLAUDE_SPRITE_FILE = "/c.bin";
const char *CODEX_SPRITE_FILE = "/x.bin";
const char *CLAUDE_GIF_FILE = "/c.gif"; // raw upload, decoded then removed
const char *CODEX_GIF_FILE = "/x.gif";
const int MAX_CUSTOM_FRAMES = 8;
const size_t CLAUDE_FRAME_BYTES = (size_t)CLAUDE_SPRITE_W * CLAUDE_SPRITE_H * 2;
const size_t CODEX_FRAME_BYTES = (size_t)CODEX_SPRITE_W * CODEX_SPRITE_H * 2;

// We never hold a whole sprite frame in RAM. Decoding a GIF needs ~24KB of
// heap for AnimatedGIF's own buffers, which wouldn't fit alongside a static
// full-frame buffer (a 120x120 frame is ~28KB) on the ESP8266's ~80KB. So both
// the display path and the decoder work one screen-row at a time through these
// two small scratch rows (SCREEN_W is the widest we ever need).
uint16_t rowBuf[SCREEN_W];     // current row being drawn / decoded
uint16_t prevRowBuf[SCREEN_W]; // decode only: same row from the previous frame

bool claudeCustom = false;
int claudeCustomFrames = 0;
bool codexCustom = false;
int codexCustomFrames = 0;
uint32_t spriteRev = 0; // bumped on upload/reset so the Mac mirror re-fetches

const int SCREEN_CX = 120, SCREEN_CY = 120;
const int RING_MARGIN = 4;      // inset from screen edge
const int RING_THICKNESS = 10;  // ring bar thickness
const unsigned long ANIM_INTERVAL_MS = 120;  // sprite frame advance
const unsigned long FLASH_INTERVAL_MS = 400; // "urgent" flash speed
const unsigned long SWITCH_BOTH_MS = 2000;   // both apps working: alternate fast

enum ActiveApp { APP_CLAUDE, APP_CODEX, APP_GROK, APP_KIMI };
ActiveApp currentApp = APP_CLAUDE;
unsigned long lastSwitchMs = 0;

// Display override, settable from the Mac app via POST /api/display:
// auto = follow working status, claude/codex = pin that app on screen,
// net/music = show Mac-side telemetry pages instead of the pet.
enum DisplayMode {
  MODE_AUTO, MODE_CLAUDE, MODE_CODEX, MODE_GROK, MODE_KIMI, MODE_NET, MODE_MUSIC, MODE_BTC
};
DisplayMode displayMode = MODE_AUTO;

// When AUTO and the Mac reports audio playing, the screen auto-switches to the
// music page and back when it stops — same spirit as the Claude/Codex auto
// switch. Only AUTO does this; a pinned mode is always honored as-is.
bool statusMusicPlaying = false;
DisplayMode lastEffectiveMode = MODE_AUTO;

// ---------- net speed mode state ----------
// Rendering is decoupled from the network: pollNet() fetches every 2s and
// only refills a queue of 250ms samples (the bridge samples at 4Hz and tags
// them with a running seq, so nothing is drawn twice or skipped). The sweep
// itself consumes exactly one queued sample every NET_DRAW_INTERVAL_MS, so
// the trace advances at a constant rate no matter how long HTTP takes.
const unsigned long NET_POLL_INTERVAL_MS = 2000; // queue refill cadence
const unsigned long NET_DRAW_INTERVAL_MS = 250;  // one chart step per bridge sample
const int NET_QUEUE = 32;
long netQRx[NET_QUEUE], netQTx[NET_QUEUE]; // ring buffer of pending samples
int netQHead = 0, netQCount = 0;
long netSeq = -1;                          // last bridge sample seq consumed into the queue
long netCurRx = 0, netCurTx = 0;           // smoothed readout for the header
int netCpuPct = -1, netMemPct = -1;        // Mac CPU/MEM row; -1 = bridge sends none (hidden)
String netLastCpuVal, netLastMemVal;       // change detection for the CPU/MEM values
bool netSysLabelsDrawn = false;
unsigned long lastNetPollMs = 0;
unsigned long lastNetDrawMs = 0;
bool netChromeDrawn = false;
bool netHeaderDirty = false;

// Chart layout (task-manager style scrolling area chart, newest at the right)
const int NET_CHART_X = 8, NET_CHART_Y = 60, NET_CHART_W = 224, NET_CHART_H = 128;
long netHistRx[NET_CHART_W], netHistTx[NET_CHART_W]; // one 250ms sample per column
long netScale = 10240;    // current "nice" full-scale value (whole chart shares it)
String netLastDl, netLastUl, netLastScaleText; // change detection for partial redraws

// ---------- music mode state ----------
const int MUSIC_COVER_W = 128;
const int MUSIC_COVER_H = 128;
// Title/artist come as a Mac-rendered bitmap strip (232x44) because the
// panel fonts are ASCII-only and CJK titles would render as blanks.
const int MUSIC_TEXT_W = 232;
const int MUSIC_TEXT_H = 44;
const int MUSIC_TEXT_X = 4, MUSIC_TEXT_Y = 150;
const unsigned long MUSIC_POLL_INTERVAL_MS = 2000;
String musicTitle, musicArtist, musicAlbum;
bool musicPlaying = false;
int musicElapsed = 0, musicDuration = 0;
int musicArtworkRev = -1;
int musicTextRev = -1;
bool musicHasArtwork = false;
bool musicChromeDrawn = false;
unsigned long lastMusicPollMs = 0;

// ---------- Market full-frame mode ----------
// Version JSON is tiny, so check once per second. The bridge's configurable
// rotation timer is intentionally independent; matching two 10-second clocks
// caused up to 10 seconds of phase delay after every rotation.
const unsigned long BTC_POLL_INTERVAL_MS = 1000;
unsigned long lastBtcPollMs = 0;
const size_t BTC_FRAME_HEADER_BYTES = 8; // uint64 big-endian version
const int BTC_FRAME_CHUNK_ROWS = 4;      // 4 rows = 1920 bytes per network read
const unsigned long BTC_VERSION_HTTP_TIMEOUT_MS = 1500;
const unsigned long BTC_FRAME_HTTP_TIMEOUT_MS = 2500;
const unsigned long BTC_FRAME_READ_TIMEOUT_MS = 1200;
const unsigned long BTC_FRAME_TOTAL_TIMEOUT_MS = 5000;
uint64_t lastBtcFrameVersion = 0;
String lastBtcFrameSession;
uint16_t btcChunkPixels[SCREEN_W * BTC_FRAME_CHUNK_ROWS];
#if defined(CONFIG_IDF_TARGET_ESP32C3)
const size_t BTC_PACKED_HEADER_BYTES = 20; // MKT1 + version + dimensions + CRC32
const size_t BTC_PACKED_MAX_BYTES = 32 * 1024;
const unsigned long BTC_PACKED_TOTAL_TIMEOUT_MS = 4000;
const unsigned long BTC_RAW_FALLBACK_INTERVAL_MS = 5000;
uint8_t btcPackedFrame[BTC_PACKED_MAX_BYTES];
uint8_t btcPackedFailureCount = 0;
unsigned long lastBtcRawFallbackMs = 0;
#endif

// ---------- Fast/Priority task ignition ----------
bool ludicrousActive = false;
bool claudeLudicrousPending = false;
bool codexLudicrousPending = false;
ActiveApp ludicrousApp = APP_CLAUDE;
unsigned long ludicrousStartMs = 0;
unsigned long lastLudicrousFrameMs = 0;
uint64_t lastClaudeFastTaskSeq = 0;
uint64_t lastCodexFastTaskSeq = 0;
bool claudeFastSeqInitialized = false;
bool codexFastSeqInitialized = false;

int claudeFrame = 0;
int codexFrame = 0;
unsigned long lastAnimMs = 0;

bool flashOn = true;
unsigned long lastFlashMs = 0;

// Bridge host is not asked for during first-time WiFi setup: the Mac/Windows
// bridge discovers the device and pairs automatically (or set via /api/bridge).
String bridgeHost;

struct ClaudeStatus {
  String status = "unknown";
  long tokensToday = 0;
  int sessionMin = 0;
  int sessionWindowMin = 300;
  float fiveHourPct = -1; // real OAuth quota from the bridge, -1 = unknown
  int fiveHourResetMin = -1; // minutes until the 5h window resets
  float sevenDayPct = -1;
  int sevenDayResetMin = -1; // minutes until the 7-day window resets
  float fablePct = -1;
  bool needsInput = false; // waiting on a permission/approval prompt
  float costToday = -1;
  uint64_t lastActivityAt = 0;
  bool fastMode = false;
  uint64_t fastTaskSeq = 0;
};

struct CodexStatus {
  String status = "unknown";
  long tokensToday = 0;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
  bool needsInput = false;
  float costToday = -1;
  uint64_t lastActivityAt = 0;
  bool fastMode = false;
  uint64_t fastTaskSeq = 0;
};

struct QuotaStatus {
  float fiveHourPct = -1;
  int fiveHourResetMin = -1;
  float weeklyPct = -1;
  int weeklyResetMin = -1;
};

ClaudeStatus claudeStatus;
CodexStatus codexStatus;
QuotaStatus grokStatus;
QuotaStatus kimiStatus;
ActiveApp preferredApp = APP_CODEX;
DisplayMode effectiveMode();
const char *displayModeName(DisplayMode m);
const char *activeAppName(ActiveApp app);
float claudeRingPct();

unsigned long lastPollMs = 0;
unsigned long lastSuccessMs = 0;
bool everPolled = false;
bool mainUiShown = false;      // false while the config-portal screen is up
bool webServerStarted = false; // deferred: port 80 clashes with the portal

