WhiteBalance2800K/esp32ai/firmware/src/main.cpp
// Wi-FiManager owns the first-time portal, but it does not guarantee that a
// later STA link loss will recover on every ESP32-C3/route combination. Keep
// a small watchdog here so the HTTP API and bridge polling come back after an
// AP roam or a transient DHCP/radio failure.
const unsigned long WIFI_RECONNECT_INTERVAL_MS = 10000;
unsigned long lastWifiReconnectMs = 0;
bool wifiWasConnected = false;

// ---------- backlight brightness ----------
// The panel backlight (TFT_BL, active LOW) is PWM-dimmable — the vendor's own
// firmware does the same. 0 = off, 100 = full. Persisted so it survives reboot.

int brightness = BRIGHTNESS_DEFAULT; // 0-100

#if defined(ESP32) && ESP_ARDUINO_VERSION_MAJOR < 3
const int BACKLIGHT_PWM_CHANNEL = 0;
#endif

void applyBrightness() {
  // Backlight is active LOW: zero duty means fully on.
#if defined(ESP32)
  uint32_t duty = (uint32_t)(100 - brightness) * 255 / 100;
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(TFT_BL, duty);
#else
  ledcWrite(BACKLIGHT_PWM_CHANNEL, duty);
#endif
#else
  analogWrite(TFT_BL, 100 - brightness);
#endif
}

void loadBrightness() {
  if (!LittleFS.exists(BRIGHTNESS_FILE)) return;
  File f = LittleFS.open(BRIGHTNESS_FILE, "r");
  if (!f) return;
  int v = f.readStringUntil('\n').toInt();
  f.close();
  if (v >= 0 && v <= 100) brightness = v;
}

void saveBrightness() {
  File f = LittleFS.open(BRIGHTNESS_FILE, "w");
  if (!f) return;
  f.println(brightness);
  f.close();
}

// ---------- persisted pet appearance ----------

enum PetPreset { PET_CLASSIC, PET_BORDER_COLLIE, PET_CUSTOM };
PetPreset petPreset = PET_CLASSIC;
int petScale = PET_SCALE_DEFAULT; // 60-100%; custom GIFs use the same size

const char *petPresetName() {
  if (petPreset == PET_BORDER_COLLIE) return "border-collie";
  if (petPreset == PET_CUSTOM) return "custom";
  return "classic";
}

int scaledPetSize(int source) {
  return (source * petScale + 50) / 100;
}

void loadPetAppearance() {
  if (!LittleFS.exists(PET_CONFIG_FILE)) return;
  File f = LittleFS.open(PET_CONFIG_FILE, "r");
  if (!f) return;
  String preset = f.readStringUntil('\n');
  int scale = f.readStringUntil('\n').toInt();
  f.close();
  preset.trim();
  if (preset == "border-collie") petPreset = PET_BORDER_COLLIE;
  else if (preset == "custom") petPreset = PET_CUSTOM;
  else petPreset = PET_CLASSIC;
  if (scale >= 60 && scale <= 100) petScale = scale;
}

void savePetAppearance() {
  File f = LittleFS.open(PET_CONFIG_FILE, "w");
  if (!f) return;
  f.println(petPresetName());
  f.println(petScale);
  f.close();
}

// ---------- persistence for the bridge host ----------

void loadBridgeHost() {
  if (LittleFS.exists(WIFI_CONFIG_FILE)) {
    File f = LittleFS.open(WIFI_CONFIG_FILE, "r");
    bridgeHost = f.readStringUntil('\n');
    bridgeHost.trim();
    f.close();
  }
}

void saveBridgeHost(const String &host) {
  File f = LittleFS.open(WIFI_CONFIG_FILE, "w");
  f.println(host);
  f.close();
}

// ---------- custom sprite loading ----------

// Checks LittleFS for a previously-uploaded custom sprite and validates its
// size before trusting it (frame count byte + exact expected byte length).
void loadCustomSpriteState() {
  claudeCustom = false;
  if (LittleFS.exists(CLAUDE_SPRITE_FILE)) {
    File f = LittleFS.open(CLAUDE_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CLAUDE_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        claudeCustom = true;
        claudeCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

  codexCustom = false;
  if (LittleFS.exists(CODEX_SPRITE_FILE)) {
    File f = LittleFS.open(CODEX_SPRITE_FILE, "r");
    if (f && f.size() >= 1) {
      uint8_t cnt = f.read();
      size_t expected = 1 + (size_t)cnt * CODEX_FRAME_BYTES;
      if (cnt > 0 && cnt <= MAX_CUSTOM_FRAMES && (size_t)f.size() == expected) {
        codexCustom = true;
        codexCustomFrames = cnt;
      }
    }
    if (f) f.close();
  }

  Serial.printf("[sprite] claude custom=%d frames=%d | codex custom=%d frames=%d\n", claudeCustom,
                claudeCustomFrames, codexCustom, codexCustomFrames);
  if (petPreset == PET_CUSTOM && !claudeCustom && !codexCustom) {
    petPreset = PET_CLASSIC;
    savePetAppearance();
  }
}

int claudeFrameCount() {
  if (petPreset == PET_CUSTOM && claudeCustom) return claudeCustomFrames;
  return petPreset == PET_BORDER_COLLIE ? BORDER_COLLIE_SPRITE_FRAMES : CLAUDE_SPRITE_FRAMES;
}
int codexFrameCount() {
  if (petPreset == PET_CUSTOM && codexCustom) return codexCustomFrames;
  return petPreset == PET_BORDER_COLLIE ? BORDER_COLLIE_SPRITE_FRAMES : CODEX_SPRITE_FRAMES;
}

// Draws one sprite frame in the upper-right, one row at a time so we never
// need a full-frame buffer: each row comes either from the custom LittleFS
// file (streamed) or the compiled-in PROGMEM default (copied row-by-row).
void drawSpriteFrame(bool custom, const char *file, const uint16_t *const *progmemFrames, int frameIdx, int w,
                     int h, size_t frameBytes, int drawW, int drawH) {
  // Keep a two-pixel breathing room from the inside edge of the 10px ring.
  // The logo remains at the upper-left, so both pets can share this chrome.
  int x0 = SCREEN_W - RING_MARGIN - RING_THICKNESS - drawW - 2;
  int y0 = 18;
  size_t rowBytes = (size_t)w * 2;
  if (custom) {
    File f = LittleFS.open(file, "r");
    if (!f) return;
    for (int r = 0; r < drawH; r++) {
      int srcY = min(h - 1, (r * h) / drawH);
      f.seek(1 + (size_t)frameIdx * frameBytes + (size_t)srcY * rowBytes);
      f.read((uint8_t *)rowBuf, rowBytes);
      for (int x = 0; x < drawW; x++) {
        int srcX = min(w - 1, (x * w) / drawW);
        prevRowBuf[x] = rowBuf[srcX];
      }
      tft.pushImage(x0, y0 + r, drawW, 1, prevRowBuf);
    }
    f.close();
  } else {
    const uint16_t *frame = progmemFrames[frameIdx];
    for (int r = 0; r < drawH; r++) {
      int srcY = min(h - 1, (r * h) / drawH);
      memcpy_P(rowBuf, frame + (size_t)srcY * w, rowBytes);
      for (int x = 0; x < drawW; x++) {
        int srcX = min(w - 1, (x * w) / drawW);
        prevRowBuf[x] = rowBuf[srcX];
      }
      tft.pushImage(x0, y0 + r, drawW, 1, prevRowBuf);
    }
  }
}

// ---------- helpers ----------

String formatTokens(long tokens) {
  if (tokens >= 1000000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fM", tokens / 1000000.0);
    return String(buf);
  }
  if (tokens >= 1000) {
    char buf[16];
    snprintf(buf, sizeof(buf), "%.1fk", tokens / 1000.0);
    return String(buf);
  }
  return String(tokens);
}

// ---------- drawing ----------

void drawStaticChrome() {
  tft.fillScreen(TFT_BLACK);
}

// Bridge unreachable / data stale -> flashing red overrides everything else,
// matches the "urgent, look now" state from the reference signal-light design.
bool bridgeStale() {
  if (!everPolled) return true;
  return (millis() - lastSuccessMs) >= 2UL * BRIDGE_POLL_INTERVAL_MS;
}

// True when the app currently on screen is waiting on a permission/approval
// prompt — drives the red "look now, act" border flash.
bool currentAppNeedsInput() {
  if (currentApp == APP_CLAUDE) return claudeStatus.needsInput;
  if (currentApp == APP_CODEX) return codexStatus.needsInput;
  return false;
}

uint16_t codexWeeklyColor(float pct) {
  if (pct >= 75.0f) return TFT_RED;
  if (pct >= 50.0f) return TFT_YELLOW;
  return TFT_GREEN;
}

// Working vs idle is conveyed by sprite animation. Claude keeps a green quota
// ring; Codex uses its weekly percentage for both ring progress and severity.
// Bridge-stale flashing red still overrides either app.
uint16_t currentStatusColor() {
  if (bridgeStale()) return flashOn ? TFT_RED : TFT_BLACK;
  if (currentApp == APP_CODEX) return codexWeeklyColor(codexStatus.weeklyPct);
  if (currentApp == APP_GROK) return codexWeeklyColor(grokStatus.weeklyPct);
  if (currentApp == APP_KIMI) return codexWeeklyColor(kimiStatus.weeklyPct);
  return TFT_GREEN;
}

// The ring is skipped when nothing changed (see drawSquareRing) so the 5s
// poll doesn't visibly blank-and-repaint it. Anything that paints over the
// ring area must invalidate this cache.
float ringLastPct = -1000;
uint16_t ringLastColor = 1;

