WhiteBalance2800K/esp32ai/firmware/src/main.cpp
// Paints the full square border in one color (all four sides), used for the
// attention flash so the whole edge blinks, not just the filled quota arc.
void drawFullBorder(uint16_t color) {
  ringLastPct = -1000; // ring got painted over; next ring draw must repaint
  int x0 = RING_MARGIN, y0 = RING_MARGIN;
  int side = SCREEN_W - 2 * RING_MARGIN;
  tft.fillRect(x0, y0, side, RING_THICKNESS, color);                              // top
  tft.fillRect(x0, SCREEN_H - RING_MARGIN - RING_THICKNESS, side, RING_THICKNESS, color); // bottom
  tft.fillRect(x0, y0, RING_THICKNESS, side, color);                              // left
  tft.fillRect(SCREEN_W - RING_MARGIN - RING_THICKNESS, y0, RING_THICKNESS, side, color); // right
}

// Square progress ring hugging the screen edge. `pct` of the perimeter
// (clockwise from top-left) is drawn in `color`, the rest in dark grey.
void drawSquareRing(float pct, uint16_t color) {
  if (pct < 0) pct = 0;
  if (pct > 100) pct = 100;
  if (pct == ringLastPct && color == ringLastColor) return; // nothing changed
  ringLastPct = pct;
  ringLastColor = color;

  int x0 = RING_MARGIN, y0 = RING_MARGIN;
  int x1 = SCREEN_W - RING_MARGIN, y1 = SCREEN_H - RING_MARGIN;
  int side = x1 - x0;
  float perimeter = side * 4.0;

  // Unfilled track is drawn black (not grey) so it blends into the background
  // and only the active quota portion is visible - still needs to be actively
  // repainted each time though, to erase a previously longer fill if the
  // percentage drops (e.g. a quota window reset).
  tft.fillRect(x0, y0, side, RING_THICKNESS, TFT_BLACK);                  // top
  tft.fillRect(x1 - RING_THICKNESS, y0, RING_THICKNESS, side, TFT_BLACK); // right
  tft.fillRect(x0, y1 - RING_THICKNESS, side, RING_THICKNESS, TFT_BLACK); // bottom
  tft.fillRect(x0, y0, RING_THICKNESS, side, TFT_BLACK);                  // left

  // filled portion, clockwise: top -> right -> bottom -> left
  float remaining = perimeter * (pct / 100.0);
  if (remaining <= 0) return;

  float seg = min(remaining, (float)side);
  tft.fillRect(x0, y0, (int)seg, RING_THICKNESS, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x1 - RING_THICKNESS, y0, RING_THICKNESS, (int)seg, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x1 - (int)seg, y1 - RING_THICKNESS, (int)seg, RING_THICKNESS, color);
  remaining -= side;
  if (remaining <= 0) return;

  seg = min(remaining, (float)side);
  tft.fillRect(x0, y1 - (int)seg, RING_THICKNESS, (int)seg, color);
}

bool appUsesCustom(ActiveApp app) {
  return petPreset == PET_CUSTOM &&
         ((app == APP_CLAUDE && claudeCustom) || (app == APP_CODEX && codexCustom));
}

bool appUsesCollie(ActiveApp app) {
  return !appUsesCustom(app) && petPreset == PET_BORDER_COLLIE;
}

int appSpriteW(ActiveApp app) {
  if (appUsesCollie(app)) return BORDER_COLLIE_SPRITE_W;
  return app == APP_CLAUDE ? CLAUDE_SPRITE_W : CODEX_SPRITE_W;
}

int appSpriteH(ActiveApp app) {
  if (appUsesCollie(app)) return BORDER_COLLIE_SPRITE_H;
  return app == APP_CLAUDE ? CLAUDE_SPRITE_H : CODEX_SPRITE_H;
}

int appSpriteFrameCount(ActiveApp app) {
  if (app == APP_CLAUDE && claudeCustom) return claudeCustomFrames;
  if (app == APP_CODEX && codexCustom) return codexCustomFrames;
  if (appUsesCollie(app)) return BORDER_COLLIE_SPRITE_FRAMES;
  return app == APP_CLAUDE ? CLAUDE_SPRITE_FRAMES : CODEX_SPRITE_FRAMES;
}

bool appHasIdleFrame(ActiveApp app) {
  if (appUsesCustom(app)) return false;
  return appUsesCollie(app) || app != APP_CLAUDE;
}

void drawAppSprite(ActiveApp app, int frameIdx) {
  bool custom = appUsesCustom(app);
  bool collie = appUsesCollie(app);
  const char *file = app == APP_CLAUDE ? CLAUDE_SPRITE_FILE : CODEX_SPRITE_FILE;
  const uint16_t *const *frames = collie ? border_collie_sprite_frames
      : app == APP_CLAUDE ? claude_sprite_frames : codex_sprite_frames;
  int w = appSpriteW(app), h = appSpriteH(app);
  size_t frameBytes = (size_t)w * h * 2;
  drawSpriteFrame(custom, file, frames, frameIdx, w, h, frameBytes,
                  scaledPetSize(w), scaledPetSize(h));
}

void drawClaudeSprite(int frameIdx) {
  drawAppSprite(APP_CLAUDE, frameIdx);
}

void drawCodexSprite(int frameIdx) {
  drawAppSprite(APP_CODEX, frameIdx);
}

String pctText(float pct) {
  return pct >= 0 ? String((int)pct) + "%" : "-";
}

// Claude quota readout below the sprite: two columns ("5h" / "Wk"), small
// grey labels over big font-4 percentages. Values repaint only when their text
// changes (force = after a full-screen clear), so the 5s poll never flashes.
const int QUOTA_LABEL_Y = 183, QUOTA_VALUE_Y = 199;
const int QUOTA_COL1_X = 70, QUOTA_COL2_X = 170;
const int CLAUDE_QUOTA_COL1_X = 45, CLAUDE_QUOTA_COL2_X = 120, CLAUDE_QUOTA_COL3_X = 195;
String lastQuota5h, lastQuotaWk, lastQuotaFable;
String lastDailyUsage;

// Faux-bold: the packed TFT_eSPI fonts have no bold face, so draw twice with
// a 1px x offset. Transparent draws - the caller must have cleared the region.
void drawBoldString(const String &s, int x, int y, int font, uint16_t color) {
  tft.setTextColor(color);
  tft.drawString(s, x, y, font);
  tft.drawString(s, x + 1, y, font);
}

void drawQuotaText(float hourPct, float weekPct, bool force) {
  tft.setTextDatum(TC_DATUM);
  if (force) {
    drawBoldString("5h", QUOTA_COL1_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
    drawBoldString("Wk", QUOTA_COL2_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
  }
  String v1 = pctText(hourPct), v2 = pctText(weekPct);
  if (force || v1 != lastQuota5h) {
    lastQuota5h = v1;
    tft.fillRect(QUOTA_COL1_X - 50, QUOTA_VALUE_Y, 100, 26, TFT_BLACK);
    drawBoldString(v1, QUOTA_COL1_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
  }
  if (force || v2 != lastQuotaWk) {
    lastQuotaWk = v2;
    tft.fillRect(QUOTA_COL2_X - 50, QUOTA_VALUE_Y, 100, 26, TFT_BLACK);
    drawBoldString(v2, QUOTA_COL2_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
  }
}

void drawClaudeQuotaText(float hourPct, float weekPct, float fablePct, bool force) {
  tft.setTextDatum(TC_DATUM);
  if (force) {
    drawBoldString("5H", CLAUDE_QUOTA_COL1_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
    drawBoldString("Weekly", CLAUDE_QUOTA_COL2_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
    drawBoldString("Fable", CLAUDE_QUOTA_COL3_X, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
  }
  String v1 = pctText(hourPct), v2 = pctText(weekPct), v3 = pctText(fablePct);
  if (force || v1 != lastQuota5h) {
    lastQuota5h = v1;
    tft.fillRect(CLAUDE_QUOTA_COL1_X - 34, QUOTA_VALUE_Y, 68, 26, TFT_BLACK);
    drawBoldString(v1, CLAUDE_QUOTA_COL1_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
  }
  if (force || v2 != lastQuotaWk) {
    lastQuotaWk = v2;
    tft.fillRect(CLAUDE_QUOTA_COL2_X - 34, QUOTA_VALUE_Y, 68, 26, TFT_BLACK);
    drawBoldString(v2, CLAUDE_QUOTA_COL2_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
  }
  if (force || v3 != lastQuotaFable) {
    lastQuotaFable = v3;
    tft.fillRect(CLAUDE_QUOTA_COL3_X - 34, QUOTA_VALUE_Y, 68, 26, TFT_BLACK);
    drawBoldString(v3, CLAUDE_QUOTA_COL3_X, QUOTA_VALUE_Y, 4, TFT_WHITE);
  }
}

// Codex intentionally shows only the weekly limit. Its 5h window is neither
// parsed by the bridge nor rendered here.
void drawCodexQuotaText(float weekPct, bool force) {
  tft.setTextDatum(TC_DATUM);
  if (force) drawBoldString("Weekly", SCREEN_CX, QUOTA_LABEL_Y, 2, TFT_LIGHTGREY);
  String value = pctText(weekPct);
  if (force || value != lastQuotaWk) {
    lastQuotaWk = value;
    tft.fillRect(SCREEN_CX - 60, QUOTA_VALUE_Y, 120, 26, TFT_BLACK);
    drawBoldString(value, SCREEN_CX, QUOTA_VALUE_Y, 4, TFT_WHITE);
  }
}

