WhiteBalance2800K/esp32ai/firmware/src/main.cpp
void drawDailyUsage(long tokens, float cost, bool force) {
  String line = "TODAY " + formatTokens(tokens) + "  " + (cost >= 0 ? "$" + String(cost, 2) : "$?");
  if (!force && line == lastDailyUsage) return;
  lastDailyUsage = line;
  tft.fillRect(0, 163, SCREEN_W, 22, TFT_BLACK);
  tft.setTextDatum(TC_DATUM);
  tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
  tft.drawString(line, SCREEN_CX, 166, 2);
}

// ---------- quota-exhausted countdown ----------
// When the current app's relevant window is used up, the pet is replaced by a
// countdown to that window's reset. Claude has 5h/weekly windows; Codex only
// has weekly. A spent weekly window deliberately has priority.

enum CdType { CD_NONE, CD_5H, CD_WEEK };

float currentHourPct() {
  if (currentApp == APP_CLAUDE) return claudeStatus.fiveHourPct;
  if (currentApp == APP_KIMI) return kimiStatus.fiveHourPct;
  return -1;
}

int currentHourResetMin() {
  if (currentApp == APP_CLAUDE) return claudeStatus.fiveHourResetMin;
  if (currentApp == APP_KIMI) return kimiStatus.fiveHourResetMin;
  return -1;
}

float currentWeekPct() {
  if (currentApp == APP_CLAUDE) return claudeStatus.sevenDayPct;
  if (currentApp == APP_CODEX) return codexStatus.weeklyPct;
  if (currentApp == APP_GROK) return grokStatus.weeklyPct;
  return kimiStatus.weeklyPct;
}

int currentWeekResetMin() {
  if (currentApp == APP_CLAUDE) return claudeStatus.sevenDayResetMin;
  if (currentApp == APP_CODEX) return codexStatus.weeklyResetMin;
  if (currentApp == APP_GROK) return grokStatus.weeklyResetMin;
  return kimiStatus.weeklyResetMin;
}

CdType desiredCountdown() {
  if (currentWeekPct() >= 99.9f && currentWeekResetMin() >= 0) return CD_WEEK;
  if ((currentApp == APP_CLAUDE || currentApp == APP_KIMI) &&
      currentHourPct() >= 99.9f && currentHourResetMin() >= 0) return CD_5H;
  return CD_NONE;
}

CdType showingCd = CD_NONE; // what's on screen now (vs desiredCountdown())
String lastCountdown;

// The bridge only reports whole minutes, so the seconds tick locally against
// a deadline anchored at millis(). Re-anchor only when the bridge disagrees
// by more than ~a minute (new window, big clock drift), otherwise a poll
// landing mid-minute would make the seconds jump around.
unsigned long cdDeadlineMs = 0; // 0 = not anchored
ActiveApp cdApp = APP_CLAUDE;   // which app/window the anchor belongs to
CdType cdAnchorType = CD_NONE;

void syncCountdownDeadline() {
  int m = showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin();
  if (m < 0) {
    cdDeadlineMs = 0;
    return;
  }
  long bridgeSec = (long)m * 60 + 30; // bridge floors to minutes: assume mid-minute
  long ourSec = (long)(cdDeadlineMs - millis()) / 1000;
  if (cdDeadlineMs == 0 || cdApp != currentApp || cdAnchorType != showingCd || ourSec < 0 ||
      labs(ourSec - bridgeSec) > 90) {
    cdDeadlineMs = millis() + (unsigned long)bridgeSec * 1000UL;
    cdApp = currentApp;
    cdAnchorType = showingCd;
  }
}

void drawCountdown(bool force) {
  long remain = cdDeadlineMs ? (long)(cdDeadlineMs - millis()) / 1000
                             : (long)(showingCd == CD_WEEK ? currentWeekResetMin() : currentHourResetMin()) * 60;
  if (remain < 0) remain = 0;
  char buf[16];
  long hours = remain / 3600;
  if (hours >= 100) // weekly can be up to 168h: h:mm:ss wouldn't fit the ring
    snprintf(buf, sizeof(buf), "%ld:%02ld", hours, (remain % 3600) / 60);
  else
    snprintf(buf, sizeof(buf), "%ld:%02ld:%02ld", hours, (remain % 3600) / 60, remain % 60);
  String t(buf);
  if (!force && t == lastCountdown) return;
  // in-place glyph overwrite can't erase a shrinking string (h:mm:ss width is
  // constant, but 100:00 -> 99:59:59 changes layout once) - clear on any
  // length change
  if (t.length() != lastCountdown.length()) force = true;
  lastCountdown = t;
  tft.setTextDatum(TC_DATUM);
  if (force) {
    tft.fillRect(SCREEN_CX - 99, 66, 198, 84, TFT_BLACK);
    drawBoldString(showingCd == CD_WEEK ? "Wk RESET IN" : "5h RESET IN", SCREEN_CX, 72, 2, TFT_LIGHTGREY);
  }
  // Background-color draw overwrites glyphs in place (no clear-then-draw
  // flash between seconds).
  tft.setTextColor(TFT_ORANGE, TFT_BLACK);
  tft.drawString(t, SCREEN_CX, 102, 6);
}

// App logo in the top-left corner (inside the quota ring) so a glance tells
// which app the screen is currently showing. Drawn row-by-row from PROGMEM
// through rowBuf, same as the sprite path.
const int LOGO_X = 14, LOGO_Y = 18;

void drawAppLogo() {
  if (currentApp == APP_GROK || currentApp == APP_KIMI) {
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(currentApp == APP_GROK ? TFT_WHITE : TFT_CYAN, TFT_BLACK);
    drawBoldString(currentApp == APP_GROK ? "GROK" : "KIMI", LOGO_X, LOGO_Y + 4, 2,
                   currentApp == APP_GROK ? TFT_WHITE : TFT_CYAN);
    return;
  }
  const uint16_t *logo = (currentApp == APP_CLAUDE) ? claude_logo_0 : codex_logo_0;
  int w = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_W : CODEX_LOGO_W;
  int h = (currentApp == APP_CLAUDE) ? CLAUDE_LOGO_H : CODEX_LOGO_H;
  for (int r = 0; r < h; r++) {
    memcpy_P(rowBuf, logo + (size_t)r * w, (size_t)w * 2);
    tft.pushImage(LOGO_X, LOGO_Y + r, w, 1, rowBuf);
  }
}

float currentRingPct() {
  if (currentApp == APP_CLAUDE) return claudeRingPct();
  if (currentApp == APP_CODEX) return codexStatus.weeklyPct;
  if (currentApp == APP_GROK) return grokStatus.weeklyPct;
  if (currentApp == APP_KIMI) {
    return kimiStatus.fiveHourPct >= 0 ? kimiStatus.fiveHourPct : kimiStatus.weeklyPct;
  }
  return 0;
}

// Claude's ring percentage: real 5h OAuth quota from the bridge when known,
// otherwise fall back to elapsed session time as a rough stand-in.
float claudeRingPct() {
  if (claudeStatus.fiveHourPct >= 0) return claudeStatus.fiveHourPct;
  return claudeStatus.sessionWindowMin > 0
             ? (100.0 * claudeStatus.sessionMin / claudeStatus.sessionWindowMin)
             : 0;
}

// Redraws whichever app is currently active, full screen: quota ring +
// sprite (or the reset countdown while the 5h window is exhausted).
// Full clear + repaint - only for real transitions (app switch, mode return,
// sprite change); steady-state data updates go through refreshActiveApp().
void drawActiveApp() {
  tft.fillScreen(TFT_BLACK);
  ringLastPct = -1000; // screen was cleared: force the ring repaint
  showingCd = desiredCountdown();
  if (showingCd != CD_NONE) syncCountdownDeadline();
  else cdDeadlineMs = 0;
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
    if (showingCd == CD_NONE) drawClaudeSprite(claudeFrame);
    drawClaudeQuotaText(claudeRingPct(), claudeStatus.sevenDayPct, claudeStatus.fablePct, true);
    drawDailyUsage(claudeStatus.tokensToday, claudeStatus.costToday, true);
  } else if (currentApp == APP_CODEX) {
    drawSquareRing(max(codexStatus.weeklyPct, 0.0f), currentStatusColor());
    if (showingCd == CD_NONE) drawCodexSprite(codexFrame);
    drawCodexQuotaText(codexStatus.weeklyPct, true);
    drawDailyUsage(codexStatus.tokensToday, codexStatus.costToday, true);
  } else if (currentApp == APP_GROK) {
    drawSquareRing(max(grokStatus.weeklyPct, 0.0f), currentStatusColor());
    if (showingCd == CD_NONE) drawAppSprite(APP_GROK, 0);
    drawCodexQuotaText(grokStatus.weeklyPct, true);
  } else {
    drawSquareRing(max(currentRingPct(), 0.0f), currentStatusColor());
    if (showingCd == CD_NONE) drawAppSprite(APP_KIMI, 0);
    drawQuotaText(kimiStatus.fiveHourPct, kimiStatus.weeklyPct, true);
  }
  if (showingCd != CD_NONE) drawCountdown(true);
  drawAppLogo();
}

// In-place refresh after a bridge poll: ring repaint + only the text that
// actually changed. No fillScreen, so the 5s poll doesn't blank the screen.
void refreshActiveApp() {
  if (desiredCountdown() != showingCd) { // pet <-> countdown (or 5h <-> weekly) swap
    drawActiveApp();
    return;
  }
  if (currentApp == APP_CLAUDE) {
    drawSquareRing(claudeRingPct(), currentStatusColor());
    drawClaudeQuotaText(claudeRingPct(), claudeStatus.sevenDayPct, claudeStatus.fablePct, false);
    drawDailyUsage(claudeStatus.tokensToday, claudeStatus.costToday, false);
  } else if (currentApp == APP_CODEX) {
    drawSquareRing(max(codexStatus.weeklyPct, 0.0f), currentStatusColor());
    drawCodexQuotaText(codexStatus.weeklyPct, false);
    drawDailyUsage(codexStatus.tokensToday, codexStatus.costToday, false);
  } else if (currentApp == APP_GROK) {
    drawSquareRing(max(grokStatus.weeklyPct, 0.0f), currentStatusColor());
    drawCodexQuotaText(grokStatus.weeklyPct, false);
  } else {
    drawSquareRing(max(currentRingPct(), 0.0f), currentStatusColor());
    drawQuotaText(kimiStatus.fiveHourPct, kimiStatus.weeklyPct, false);
  }
  if (showingCd != CD_NONE) {
    syncCountdownDeadline();
    drawCountdown(false);
  }
}

// Redraws just the ring (cheap) - used for status color animation ticks
// between full redraws.
void redrawRingOnly() {
  drawSquareRing(max(currentRingPct(), 0.0f), currentStatusColor());
}

// Who gets the screen:
//   - display mode pinned (Mac app) -> that app, always
//   - exactly one app working       -> that app, immediately
//   - both working                  -> alternate every SWITCH_BOTH_MS (2s)
//   - neither working               -> keep the most recently active app
bool updateActiveApp() {
  ActiveApp desired = currentApp;

  if (displayMode == MODE_CLAUDE) {
    desired = APP_CLAUDE;
  } else if (displayMode == MODE_CODEX) {
    desired = APP_CODEX;
  } else if (displayMode == MODE_GROK) {
    desired = APP_GROK;
  } else if (displayMode == MODE_KIMI) {
    desired = APP_KIMI;
  } else if (claudeStatus.needsInput && !codexStatus.needsInput) {
    desired = APP_CLAUDE; // approval prompt wins the screen
  } else if (codexStatus.needsInput && !claudeStatus.needsInput) {
    desired = APP_CODEX;
  } else {
    bool claudeWorking = claudeStatus.status == "working";
    bool codexWorking = codexStatus.status == "working";
    if (claudeWorking && !codexWorking) {
      desired = APP_CLAUDE;
    } else if (codexWorking && !claudeWorking) {
      desired = APP_CODEX;
    } else if (claudeWorking && codexWorking) {
      if (millis() - lastSwitchMs >= SWITCH_BOTH_MS) {
        lastSwitchMs = millis();
        desired = (currentApp == APP_CLAUDE) ? APP_CODEX : APP_CLAUDE;
      }
    } else {
      desired = preferredApp;
    }
  }

