WhiteBalance2800K/esp32ai/firmware/src/main.cpp
BtcPackedResult pollBtcPackedFrame(uint64_t expectedVersion) {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return BTC_PACKED_FAILED;
  const unsigned long startedMs = millis();
  WiFiClient client;
  client.setTimeout(BTC_FRAME_READ_TIMEOUT_MS);
  HTTPClient http;
  String url = "http://" + bridgeHost + "/btc/frame.rle";
  http.setTimeout(BTC_FRAME_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return BTC_PACKED_FAILED;
  const int code = http.GET();
  if (code == HTTP_CODE_NOT_FOUND) {
    http.end();
    return BTC_PACKED_UNAVAILABLE;
  }
  const int frameBytes = http.getSize();
  if (code != HTTP_CODE_OK || frameBytes < (int)BTC_PACKED_HEADER_BYTES ||
      frameBytes > (int)BTC_PACKED_MAX_BYTES) {
    Serial.printf("[btc] packed GET -> %d size=%d max=%u\n", code, frameBytes,
                  (unsigned)BTC_PACKED_MAX_BYTES);
    http.end();
    return BTC_PACKED_FAILED;
  }

  WiFiClient *stream = http.getStreamPtr();
  const bool received = readBtcExact(stream, btcPackedFrame, (size_t)frameBytes,
                                     BTC_PACKED_TOTAL_TIMEOUT_MS);
  http.end();
  if (!received) {
    Serial.printf("[btc] packed frame timeout bytes=%d\n", frameBytes);
    return BTC_PACKED_FAILED;
  }

  uint64_t version = 0;
  if (!validateBtcPackedFrame((size_t)frameBytes, expectedVersion, version)) {
    Serial.printf("[btc] packed frame validation failed size=%d expected=%llu last=%llu\n",
                  frameBytes, (unsigned long long)expectedVersion,
                  (unsigned long long)lastBtcFrameVersion);
    return BTC_PACKED_FAILED;
  }
  const unsigned long downloadedMs = millis();
  drawBtcPackedFrame((size_t)frameBytes);
  lastBtcFrameVersion = version;
  Serial.printf("[btc] packed frame applied version=%llu bytes=%d download=%lums draw=%lums heap=%u min=%u\n",
                (unsigned long long)version, frameBytes, downloadedMs - startedMs,
                millis() - downloadedMs, ESP.getFreeHeap(), ESP.getMinFreeHeap());
  return BTC_PACKED_OK;
}
#endif

void pollBtc() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return;
  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + "/btc/version";
  http.setTimeout(BTC_VERSION_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    Serial.printf("[btc] version GET -> %d\n", code);
    http.end();
    return;
  }
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, http.getString());
  http.end();
  if (err) {
    Serial.println("[btc] version JSON parse failed");
    return;
  }
  const char *session = doc["session"] | "";
  if (session[0] != '\0' && lastBtcFrameSession != session) {
    Serial.printf("[btc] bridge frame session changed: %s\n", session);
    lastBtcFrameSession = session;
    lastBtcFrameVersion = 0;
#if defined(CONFIG_IDF_TARGET_ESP32C3)
    btcPackedFailureCount = 0;
    lastBtcRawFallbackMs = 0;
#endif
  }
  uint64_t version = doc["version"] | (uint64_t)0;
  if (version == 0 || version <= lastBtcFrameVersion) return;
#if defined(CONFIG_IDF_TARGET_ESP32C3)
  const char *codec = doc["codec"] | "";
  const size_t packedBytes = doc["packed_bytes"] | (size_t)0;
  // Negotiate the compact route from /version instead of assuming every
  // bridge revision and every future renderer fits this fixed C3 buffer.
  // Older/unknown/oversized frames retain the raw compatibility path.
  if (strcmp(codec, "rgb565-packbits-v1") == 0 &&
      packedBytes >= BTC_PACKED_HEADER_BYTES && packedBytes <= BTC_PACKED_MAX_BYTES) {
    const BtcPackedResult result = pollBtcPackedFrame(version);
    if (result == BTC_PACKED_OK) {
      btcPackedFailureCount = 0;
    } else if (result == BTC_PACKED_UNAVAILABLE) {
      btcPackedFailureCount = 0;
      pollBtcRawFrame(version);
    } else {
      if (btcPackedFailureCount < 255) ++btcPackedFailureCount;
      // A corrupt or incompatible compact route must not freeze the market
      // page forever. Retry once, then periodically use the legacy route
      // while continuing to probe the compact route every second.
      if (btcPackedFailureCount >= 2 &&
          (lastBtcRawFallbackMs == 0 ||
           millis() - lastBtcRawFallbackMs >= BTC_RAW_FALLBACK_INTERVAL_MS)) {
        lastBtcRawFallbackMs = millis();
        Serial.printf("[btc] packed failed %u times; trying raw fallback\n",
                      btcPackedFailureCount);
        if (pollBtcRawFrame(version)) btcPackedFailureCount = 0;
      }
    }
  } else {
    btcPackedFailureCount = 0;
    Serial.printf("[btc] raw fallback codec=%s packed=%u\n", codec,
                  (unsigned)packedBytes);
    pollBtcRawFrame(version);
  }
#else
  pollBtcRawFrame(version);
#endif
}

void drawLudicrousFrame(float p) {
  tft.fillScreen(TFT_BLACK);
  int cx = SCREEN_CX, cy = SCREEN_CY;
  uint16_t silver = tft.color565(190, 195, 205);
  for (int i = 0; i < 14; i++) {
    float a = i * 6.2831853f / 14.0f + p * 0.45f;
    float inner = 12 + p * 45;
    float outer = 34 + p * 190;
    tft.drawLine(cx + cosf(a) * inner, cy + sinf(a) * inner,
                 cx + cosf(a) * outer, cy + sinf(a) * outer, silver);
  }
  for (int ring = 0; ring < 3; ring++) {
    int radius = ((int)(p * 150) + ring * 28) % 170;
    if (radius > 1) tft.drawCircle(cx, cy, radius, TFT_RED);
  }
  for (int i = 0; i < 34; i++) {
    float seed = ((i * 47) % 101) / 101.0f;
    float a = i * 29 * 3.1415926f / 90.0f;
    float d = 18 + (seed + p) * 145;
    int x = cx + cosf(a) * d, y = cy + sinf(a) * d;
    if (x >= 0 && x < SCREEN_W && y >= 0 && y < SCREEN_H) tft.fillCircle(x, y, 1, TFT_WHITE);
  }
  tft.setTextDatum(MC_DATUM);
  tft.setTextColor(TFT_WHITE);
  tft.drawString("LUDICROUS +", cx, cy, 2);
}

void startPendingLudicrous() {
  if (!claudeLudicrousPending && !codexLudicrousPending) return;
  DisplayMode eff = effectiveMode();
  if (eff == MODE_NET || eff == MODE_MUSIC || eff == MODE_BTC ||
      eff == MODE_GROK || eff == MODE_KIMI) {
    claudeLudicrousPending = codexLudicrousPending = false;
    return;
  }
  if (displayMode == MODE_CLAUDE) {
    codexLudicrousPending = false;
    if (!claudeLudicrousPending) return;
    ludicrousApp = APP_CLAUDE;
  } else if (displayMode == MODE_CODEX) {
    claudeLudicrousPending = false;
    if (!codexLudicrousPending) return;
    ludicrousApp = APP_CODEX;
  } else if (preferredApp == APP_CLAUDE && claudeLudicrousPending) {
    ludicrousApp = APP_CLAUDE;
  } else if (codexLudicrousPending) {
    ludicrousApp = APP_CODEX;
  } else {
    ludicrousApp = APP_CLAUDE;
  }
  if (ludicrousApp == APP_CLAUDE) claudeLudicrousPending = false;
  else codexLudicrousPending = false;
  if (displayMode == MODE_AUTO) currentApp = ludicrousApp;
  ludicrousActive = true;
  ludicrousStartMs = millis();
  lastLudicrousFrameMs = 0;
}

