WhiteBalance2800K/esp32ai/firmware/src/main.cpp
// ---------- WiFi / bridge polling ----------

WiFiManager wifiManager; // global: the config portal now runs non-blocking in loop()

const uint16_t *setupChineseRows(uint32_t codepoint) {
  for (size_t i = 0; i < SETUP_CHINESE_GLYPH_COUNT; ++i) {
    if (SETUP_CHINESE_GLYPHS[i].codepoint == codepoint) return SETUP_CHINESE_GLYPHS[i].rows;
  }
  return nullptr;
}

uint32_t nextSetupCodepoint(const uint8_t *&cursor) {
  const uint8_t first = *cursor++;
  if (first < 0x80) return first;
  if ((first & 0xE0) == 0xC0 && cursor[0] != 0) {
    const uint32_t cp = ((uint32_t)(first & 0x1F) << 6) | (uint32_t)(cursor[0] & 0x3F);
    cursor += 1;
    return cp;
  }
  if ((first & 0xF0) == 0xE0 && cursor[0] != 0 && cursor[1] != 0) {
    const uint32_t cp = ((uint32_t)(first & 0x0F) << 12) |
                        ((uint32_t)(cursor[0] & 0x3F) << 6) | (uint32_t)(cursor[1] & 0x3F);
    cursor += 2;
    return cp;
  }
  if ((first & 0xF8) == 0xF0 && cursor[0] != 0 && cursor[1] != 0 && cursor[2] != 0) {
    const uint32_t cp = ((uint32_t)(first & 0x07) << 18) |
                        ((uint32_t)(cursor[0] & 0x3F) << 12) |
                        ((uint32_t)(cursor[1] & 0x3F) << 6) | (uint32_t)(cursor[2] & 0x3F);
    cursor += 3;
    return cp;
  }
  return 0xFFFD;
}

// Draw the handful of Chinese labels used by the first-boot Wi-Fi screen.
// Normal TFT_eSPI text remains the faster ASCII path everywhere else.
void drawSetupText(const char *text, int x, int y, uint16_t color) {
  tft.setTextColor(color, TFT_BLACK);
  const uint8_t *cursor = reinterpret_cast<const uint8_t *>(text);
  while (*cursor != 0) {
    const uint32_t codepoint = nextSetupCodepoint(cursor);
    if (codepoint < 0x80) {
      tft.drawChar((uint16_t)codepoint, x, y, 2);
      x += 12;
      continue;
    }

    const uint16_t *rows = setupChineseRows(codepoint);
    if (rows != nullptr) {
      for (int row = 0; row < 16; ++row) {
        uint16_t bits = rows[row];
        for (int column = 0; column < 16; ++column) {
          if (bits & (uint16_t)(1U << (15 - column))) tft.drawPixel(x + column, y + row, color);
        }
      }
    }
    x += 16;
  }
}

void configModeCallback(WiFiManager *wm) {
  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  drawSetupText("正在连接 WiFi", 8, 32, TFT_WHITE);
  drawSetupText("手机连热点:", 8, 62, TFT_WHITE);
  drawSetupText("热点: ", 8, 87, TFT_YELLOW);
  tft.drawString(WIFI_PORTAL_AP_NAME, 80, 87, 2);
  drawSetupText("打开 192.168.4.1", 8, 117, TFT_WHITE);
  drawSetupText("USB 连接电脑", 8, 155, TFT_CYAN);
  drawSetupText("无需 WiFi", 8, 178, TFT_CYAN);
  drawSetupText("固件: ", 8, 215, TFT_DARKGREY);
  tft.drawString(FW_VERSION, 80, 215, 2);
}

void maintainWiFi() {
  const wl_status_t status = WiFi.status();
  if (status == WL_CONNECTED) {
    if (!wifiWasConnected) {
      wifiWasConnected = true;
      Serial.printf("[wifi] reconnected ssid=%s ip=%s\n", WiFi.SSID().c_str(),
                    WiFi.localIP().toString().c_str());
      lastPollMs = 0;
    }
    return;
  }

  // Do not fight the first-time config portal when there are no saved
  // credentials. Once STA has connected at least once (or credentials are
  // present), explicitly ask the Arduino Wi-Fi stack to retry.
  if (!wifiWasConnected && WiFi.SSID().length() == 0) return;
  unsigned long now = millis();
  if (now - lastWifiReconnectMs < WIFI_RECONNECT_INTERVAL_MS) return;
  lastWifiReconnectMs = now;
  Serial.printf("[wifi] disconnected status=%d, reconnecting...\n", (int)status);
  WiFi.reconnect();
}

// Non-blocking: with saved credentials this still waits ~10s for the join,
// but a missing/failed WiFi no longer traps boot in the portal - the portal
// keeps running from loop() while the USB serial link can take over the
// screen (wired mode for APs with client isolation).
void setupWiFi() {
  WiFi.setAutoReconnect(true);
#if defined(ESP32)
  // This clock is USB powered. Disabling modem sleep removes DTIM receive
  // stalls while a compressed market frame is arriving.
  WiFi.setSleep(false);
#endif
  wifiManager.setAPCallback(configModeCallback);
  wifiManager.setConfigPortalBlocking(false);

  tft.fillScreen(TFT_BLACK);
  tft.setTextDatum(TL_DATUM);
  drawSetupText("正在连接 WiFi", 8, 100, TFT_WHITE);

  Serial.println("[wifi] starting WiFiManager autoConnect (non-blocking portal)...");
  bool ok = wifiManager.autoConnect(WIFI_PORTAL_AP_NAME);
  Serial.printf("[wifi] autoConnect result=%d ssid=%s ip=%s\n", ok, WiFi.SSID().c_str(),
                WiFi.localIP().toString().c_str());
  Serial.printf("[wifi] bridge host = '%s'\n", bridgeHost.c_str());
}

void observeFastTask(ActiveApp app, uint64_t seq) {
  uint64_t &last = app == APP_CLAUDE ? lastClaudeFastTaskSeq : lastCodexFastTaskSeq;
  bool &initialized = app == APP_CLAUDE ? claudeFastSeqInitialized : codexFastSeqInitialized;
  if (!initialized) {
    initialized = true;
    last = seq;
    return; // boot baseline: never replay an old task
  }
  if (seq > last) {
    last = seq;
    if (app == APP_CLAUDE) claudeLudicrousPending = true;
    else codexLudicrousPending = true;
  }
}

bool parseStatusJson(const String &payload) {
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, payload);
  if (err) return false;

  JsonObject c = doc["claude"];
  if (!c.isNull()) {
    claudeStatus.status = c["status"] | "unknown";
    claudeStatus.tokensToday = c["tokens_today"] | 0;
    claudeStatus.sessionMin = c["session_min"] | 0;
    claudeStatus.sessionWindowMin = c["session_window_min"] | 300;
    claudeStatus.fiveHourPct = c["five_hour_pct"] | -1.0;
    claudeStatus.fiveHourResetMin = c["five_hour_reset_min"] | -1;
    claudeStatus.sevenDayPct = c["seven_day_pct"] | -1.0;
    claudeStatus.sevenDayResetMin = c["seven_day_reset_min"] | -1;
    claudeStatus.fablePct = c["fable_pct"] | -1.0;
    claudeStatus.needsInput = c["needs_input"] | false;
    claudeStatus.costToday = c["cost_today_usd"].is<float>() ? c["cost_today_usd"].as<float>() : -1;
    claudeStatus.lastActivityAt = c["last_activity_at"] | (uint64_t)0;
    claudeStatus.fastMode = c["fast_mode"] | false;
    claudeStatus.fastTaskSeq = c["fast_task_seq"] | (uint64_t)0;
    observeFastTask(APP_CLAUDE, claudeStatus.fastTaskSeq);
  }

  JsonObject x = doc["codex"];
  if (!x.isNull()) {
    codexStatus.status = x["status"] | "unknown";
    codexStatus.tokensToday = x["tokens_today"] | 0;
    codexStatus.weeklyPct = x["weekly_pct"] | -1.0;
    codexStatus.weeklyResetMin = x["weekly_reset_min"] | -1;
    codexStatus.needsInput = x["needs_input"] | false;
    codexStatus.costToday = x["cost_today_usd"].is<float>() ? x["cost_today_usd"].as<float>() : -1;
    codexStatus.lastActivityAt = x["last_activity_at"] | (uint64_t)0;
    codexStatus.fastMode = x["fast_mode"] | false;
    codexStatus.fastTaskSeq = x["fast_task_seq"] | (uint64_t)0;
    observeFastTask(APP_CODEX, codexStatus.fastTaskSeq);
  }
  JsonObject g = doc["grok"];
  if (!g.isNull()) {
    grokStatus.weeklyPct = g["weekly_pct"] | -1.0;
    grokStatus.weeklyResetMin = g["weekly_reset_min"] | -1;
  }
  JsonObject k = doc["kimi"];
  if (!k.isNull()) {
    kimiStatus.fiveHourPct = k["five_hour_pct"] | -1.0;
    kimiStatus.fiveHourResetMin = k["five_hour_reset_min"] | -1;
    kimiStatus.weeklyPct = k["weekly_pct"] | -1.0;
    kimiStatus.weeklyResetMin = k["weekly_reset_min"] | -1;
  }
  const char *preferred = doc["preferred_agent"] | "codex";
  preferredApp = String(preferred) == "claude" ? APP_CLAUDE : APP_CODEX;
  statusMusicPlaying = doc["music_playing"] | false;
  return true;
}

// The mode actually rendered. In AUTO: a pending approval prompt wins (stay on
// the pet so its border can flash red at you), otherwise audio promotes to the
// music page.
DisplayMode effectiveMode() {
  if (displayMode == MODE_AUTO) {
    if (claudeStatus.needsInput || codexStatus.needsInput) return MODE_AUTO;
    // music page needs HTTP for cover/text bitmaps, so don't auto-promote
    // when running wired-only (no WiFi)
    if (statusMusicPlaying && WiFi.status() == WL_CONNECTED) return MODE_MUSIC;
  }
  return displayMode;
}

