WhiteBalance2800K/esp32ai/firmware/src/main.cpp
void pollBridge() {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) {
    Serial.printf("[bridge] skip poll: wifi=%d host='%s'\n", WiFi.status() == WL_CONNECTED, bridgeHost.c_str());
    return;
  }

  WiFiClient client;
  HTTPClient http;
  String url = "http://" + bridgeHost + BRIDGE_DEFAULT_PATH;
  http.setTimeout(BRIDGE_HTTP_TIMEOUT_MS);

  if (!http.begin(client, url)) {
    Serial.println("[bridge] http.begin() failed");
    return;
  }
  int code = http.GET();
  Serial.printf("[bridge] GET %s -> %d\n", url.c_str(), code);
  if (code == HTTP_CODE_OK) {
    String payload = http.getString();
    if (parseStatusJson(payload)) {
      lastSuccessMs = millis();
      everPolled = true;
      Serial.printf("[bridge] claude=%s tok=%ld | codex=%s tok=%ld weekly=%.0f%% | grok=%.0f%% kimi=%.0f%%\n",
                    claudeStatus.status.c_str(), claudeStatus.tokensToday,
                    codexStatus.status.c_str(), codexStatus.tokensToday, codexStatus.weeklyPct,
                    grokStatus.weeklyPct, kimiStatus.weeklyPct);
    } else {
      Serial.println("[bridge] JSON parse failed");
    }
  } else {
    claudeStatus.status = "offline";
    codexStatus.status = "offline";
  }
  http.end();
  DisplayMode eff = effectiveMode();
  if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_BTC) {
    // Only a real app switch clears the screen; a plain data refresh paints
    // in place so the poll doesn't flash the whole display.
    bool switched = ludicrousActive ? false : updateActiveApp();
    if (!ludicrousActive) {
      if (switched) drawActiveApp();
      else refreshActiveApp();
    }
    startPendingLudicrous();
  }
}

// ---------- wired (USB serial) bridge link ----------
// Fallback for WiFi networks with client isolation (device can't reach the
// bridge over LAN) - or for skipping WiFi setup entirely: when the clock is
// plugged into the computer over USB, the bridge pushes the same /status and
// /net payloads down the CH340 serial line as newline-terminated frames:
//   bridge -> device:  #HELLO   #STATUS {json}   #NET {json}   #CMD {json}
//   device -> bridge:  #DEVICE {"name":"aiclock","fw":"x.y.z"}
// Everything else the device prints (logs) is ignored by the bridge.
unsigned long lastSerialFrameMs = 0;
bool wiredEverLinked = false;
char serialLine[1600]; // biggest frame is #STATUS at ~600 bytes
size_t serialLineLen = 0;

bool wiredActive() { return wiredEverLinked && (millis() - lastSerialFrameMs) < 15000UL; }

// First data over either transport replaces the boot/portal screen.
void showMainUiIfNeeded() {
  if (mainUiShown) return;
  mainUiShown = true;
  drawStaticChrome();
  updateActiveApp();
  drawActiveApp();
}

// The USB link used to acknowledge only with {name,fw}. That was enough to
// feed the panel, but it left the Mac app's HTTP-only device controls looking
// offline whenever Wi-Fi was unavailable. Return the same compact state as
// /api/info so the app can use the USB path as a real control/status fallback.
void sendSerialDeviceInfo() {
  JsonDocument doc;
  doc["name"] = "aiclock";
  doc["fw"] = FW_VERSION;
  doc["ip"] = WiFi.localIP().toString();
  doc["ssid"] = WiFi.SSID();
  doc["bridge"] = bridgeHost;
  doc["mode"] = displayModeName(displayMode);
  doc["effective"] = displayModeName(effectiveMode());
  doc["showing"] = activeAppName(currentApp);
  doc["last_update_s"] = everPolled ? (long)((millis() - lastSuccessMs) / 1000) : -1;
  doc["sprite_rev"] = spriteRev;
  doc["brightness"] = brightness;
  doc["pet_preset"] = petPresetName();
  doc["pet_scale"] = petScale;
  doc["sprite_w"] = appSpriteW(currentApp);
  doc["sprite_h"] = appSpriteH(currentApp);
  doc["sprite_display_w"] = scaledPetSize(appSpriteW(currentApp));
  doc["sprite_display_h"] = scaledPetSize(appSpriteH(currentApp));
  doc["sprite_custom"] = appUsesCustom(currentApp);
  doc["wired"] = true;
  JsonObject c = doc["claude"].to<JsonObject>();
  c["status"] = claudeStatus.status;
  c["custom_sprite"] = claudeCustom;
  c["w"] = appSpriteW(APP_CLAUDE);
  c["h"] = appSpriteH(APP_CLAUDE);
  c["display_w"] = scaledPetSize(appSpriteW(APP_CLAUDE));
  c["display_h"] = scaledPetSize(appSpriteH(APP_CLAUDE));
  JsonObject x = doc["codex"].to<JsonObject>();
  x["status"] = codexStatus.status;
  x["custom_sprite"] = codexCustom;
  x["w"] = appSpriteW(APP_CODEX);
  x["h"] = appSpriteH(APP_CODEX);
  x["display_w"] = scaledPetSize(appSpriteW(APP_CODEX));
  x["display_h"] = scaledPetSize(appSpriteH(APP_CODEX));
  String out;
  serializeJson(doc, out);
  Serial.print("#DEVICE ");
  Serial.println(out);
}

void handleSerialFrame(char *line) {
  lastSerialFrameMs = millis();
  wiredEverLinked = true;
  if (!strncmp(line, "#HELLO", 6) || !strncmp(line, "#GETINFO", 8)) {
    sendSerialDeviceInfo();
    return;
  }
  if (!strncmp(line, "#STATUS ", 8)) {
    if (parseStatusJson(String(line + 8))) {
      lastSuccessMs = millis();
      everPolled = true;
      showMainUiIfNeeded();
      DisplayMode eff = effectiveMode();
      if (eff != MODE_NET && eff != MODE_MUSIC && eff != MODE_BTC) {
        bool switched = ludicrousActive ? false : updateActiveApp();
        if (!ludicrousActive) {
          if (switched) drawActiveApp();
          else refreshActiveApp();
        }
        startPendingLudicrous();
      }
    }
    return;
  }
  if (!strncmp(line, "#NET ", 5)) {
    handleNetPayload(String(line + 5));
    return;
  }
  if (!strncmp(line, "#CMD ", 5)) {
    JsonDocument doc;
    if (deserializeJson(doc, line + 5)) return;
    if (doc["brightness"].is<int>()) {
      brightness = constrain(doc["brightness"].as<int>(), 0, 100);
      applyBrightness();
      saveBrightness();
    }
    const char *mode = doc["display"] | (const char *)nullptr;
    if (mode) {
      String m(mode);
      if (m == "auto") displayMode = MODE_AUTO;
      else if (m == "claude") displayMode = MODE_CLAUDE;
      else if (m == "codex") displayMode = MODE_CODEX;
      else if (m == "grok") displayMode = MODE_GROK;
      else if (m == "kimi") displayMode = MODE_KIMI;
      else if (m == "net") displayMode = MODE_NET;
      else if (m == "music") displayMode = MODE_MUSIC;
      else if (m == "btc") displayMode = MODE_BTC;
      // the effectiveMode transition handler in loop() repaints the chrome
    }
    const char *preset = doc["pet_preset"] | (const char *)nullptr;
    if (preset) {
      String p(preset);
      if (p == "border-collie") petPreset = PET_BORDER_COLLIE;
      else if (p == "custom" && (claudeCustom || codexCustom)) petPreset = PET_CUSTOM;
      else petPreset = PET_CLASSIC;
    }
    if (doc["pet_scale"].is<int>()) {
      petScale = constrain(doc["pet_scale"].as<int>(), 60, 100);
    }
    if (preset || doc["pet_scale"].is<int>()) {
      savePetAppearance();
      spriteRev++;
      claudeFrame = codexFrame = 0;
      if (mainUiShown && effectiveMode() != MODE_NET && effectiveMode() != MODE_MUSIC &&
          effectiveMode() != MODE_BTC) drawActiveApp();
    }
    const char *newBridge = doc["bridge"] | (const char *)nullptr;
    if (newBridge && strlen(newBridge) > 0) {
      bridgeHost = newBridge;
      bridgeHost.trim();
      saveBridgeHost(bridgeHost);
      lastPollMs = 0;
    }
    sendSerialDeviceInfo();
    return;
  }
}

