WhiteBalance2800K/esp32ai/firmware/src/main.cpp
// Drains the UART, splitting on newlines; frames start with '#', everything
// else (line noise, echoes) is dropped.
void pumpSerial() {
  while (Serial.available()) {
    char ch = (char)Serial.read();
    if (ch == '\n' || ch == '\r') {
      if (serialLineLen > 0 && serialLine[0] == '#') {
        serialLine[serialLineLen] = 0;
        handleSerialFrame(serialLine);
      }
      serialLineLen = 0;
    } else if (serialLineLen < sizeof(serialLine) - 1) {
      serialLine[serialLineLen++] = ch;
    } else {
      serialLineLen = 0; // oversized line: drop it
    }
  }
}

// ---------- web admin ----------

String htmlEscape(const String &s) {
  String out = s;
  out.replace("&", "&amp;");
  out.replace("<", "&lt;");
  out.replace(">", "&gt;");
  out.replace("\"", "&quot;");
  return out;
}

void handleRoot() {
  String age = everPolled ? String((millis() - lastSuccessMs) / 1000) + "s ago" : "never";
  String html;
  html.reserve(3072);
  html += "<!DOCTYPE html><html><head><meta charset='utf-8'>";
  html += "<meta name='viewport' content='width=device-width, initial-scale=1'>";
  html += "<title>AI Clock 设置</title>";
  html += "<style>body{font-family:-apple-system,sans-serif;max-width:480px;margin:24px "
          "auto;padding:0 16px;color:#222} h1{font-size:20px} label{display:block;margin-top:16px;font-weight:600}"
          "input{width:100%;box-sizing:border-box;padding:8px;font-size:16px;margin-top:4px}"
          "button{margin-top:16px;padding:10px 20px;font-size:16px;background:#2563eb;color:#fff;"
          "border:none;border-radius:6px}"
          "table{margin-top:20px;border-collapse:collapse;width:100%}"
          "td{padding:4px 8px;border-bottom:1px solid #eee;font-size:14px}"
          ".dot{display:inline-block;width:10px;height:10px;border-radius:50%;margin-right:6px}"
          "</style></head><body>";
  html += "<h1>AI Clock 设置</h1>";

  html += "<form method='POST' action='/save'>";
  html += "<label>Bridge host (ip:port)</label>";
  html += "<input name='bridge' value='" + htmlEscape(bridgeHost) + "' placeholder='192.168.1.181:8765'>";
  html += "<button type='submit'>保存</button>";
  html += "</form>";

  // Backlight brightness slider: applies live on release (PWM, persisted).
  html += "<h2 style='font-size:16px;margin-top:28px'>屏幕亮度</h2>";
  html += "<input type='range' min='0' max='100' value='" + String(brightness) + "' id='bri' "
          "oninput=\"document.getElementById('briv').textContent=this.value+'%'\" "
          "onchange=\"fetch('/api/brightness',{method:'POST',headers:{'Content-Type':"
          "'application/x-www-form-urlencoded'},body:'level='+this.value})\">";
  html += "<div style='font-size:13px;color:#555'>当前：<span id='briv'>" + String(brightness) +
          "%</span>（0 = 熄屏，设置立即生效并记住）</div>";

  html += "<h2 style='font-size:16px;margin-top:28px'>桌宠外观</h2>";
  html += "<label>宠物样式</label><select id='petPreset' onchange='savePet()'>"
          "<option value='classic'";
  if (petPreset == PET_CLASSIC) html += " selected";
  html += ">经典宠物</option><option value='border-collie'";
  if (petPreset == PET_BORDER_COLLIE) html += " selected";
  html += ">咖色边牧</option><option value='custom'";
  if (petPreset == PET_CUSTOM) html += " selected";
  if (!claudeCustom && !codexCustom) html += " disabled";
  html += ">自定义</option></select>";
  html += "<label>宠物大小</label><input type='range' min='60' max='100' step='5' value='" +
          String(petScale) + "' id='petScale' "
          "oninput=\"document.getElementById('petsv').textContent=this.value+'%'\" "
          "onchange='savePet()'>";
  html += "<div style='font-size:13px;color:#555'>当前：<span id='petsv'>" + String(petScale) +
          "%</span></div>";
  html += "<script>function savePet(){fetch('/api/pet',{method:'POST',headers:{'Content-Type':"
          "'application/x-www-form-urlencoded'},body:'preset='+document.getElementById('petPreset').value+"
          "'&scale='+document.getElementById('petScale').value})}</script>";

  // On-device GIF upload is the custom option of the same pet appearance section.
  html += "<h3 style='font-size:15px;margin-top:22px'>自定义（上传 GIF）</h3>";
  html += "<p style='font-size:13px;color:#555'>上传一个 .gif，设备会在板上解码并缩放到对应角色的尺寸，"
          "立刻替换动画，无需重新编译或烧录。GIF 太大可能因内存不足解码失败，换小一点的即可。</p>";
  html += "<form id='gifForm' method='POST' enctype='multipart/form-data' onsubmit='return setGifAction()'>";
  html += "<label>角色</label>";
  html += "<select id='gifTarget'><option value='claude'>Claude</option><option value='codex'>Codex</option></select>";
  html += "<label>GIF 文件</label><input type='file' name='file' accept='.gif' required>";
  html += "<button type='submit'>上传并应用</button>";
  html += "</form>";
  html += "<script>function setGifAction(){"
          "document.getElementById('gifForm').action='/sprite/'+document.getElementById('gifTarget').value;"
          "return true;}</script>";

  html += "<table>";
  html += "<tr><td>WiFi SSID</td><td>" + htmlEscape(WiFi.SSID()) + "</td></tr>";
  html += "<tr><td>设备 IP</td><td>" + WiFi.localIP().toString() + "</td></tr>";
  html += "<tr><td>上次桥接更新</td><td>" + age + "</td></tr>";
  html += "<tr><td>Claude</td><td>" + htmlEscape(claudeStatus.status) + ", " +
          formatTokens(claudeStatus.tokensToday) + " tok</td></tr>";
  html += "<tr><td>Codex</td><td>" + htmlEscape(codexStatus.status) + ", " +
          formatTokens(codexStatus.tokensToday) + " tok, Weekly " +
          (codexStatus.weeklyPct >= 0 ? String(codexStatus.weeklyPct, 0) + "%" : "?") + "</td></tr>";
  html += "</table>";

  html += "<form method='POST' action='/reset-wifi' onsubmit=\"return confirm('清除 WiFi "
          "设置并重启？设备会开启配网热点。');\">";
  html += "<button type='submit' style='background:#dc2626'>重置 WiFi</button>";
  html += "</form>";

  html += "</body></html>";
  webServer.send(200, "text/html", html);
}

void handleSave() {
  String newHost = webServer.arg("bridge");
  newHost.trim();
  bridgeHost = newHost;
  saveBridgeHost(bridgeHost);
  Serial.printf("[web] bridge host updated to '%s'\n", bridgeHost.c_str());
  webServer.sendHeader("Location", "/");
  webServer.send(303);
}

// ---------- JSON API for the Mac app ----------

const char *displayModeName(DisplayMode m) {
  if (m == MODE_CLAUDE) return "claude";
  if (m == MODE_CODEX) return "codex";
  if (m == MODE_GROK) return "grok";
  if (m == MODE_KIMI) return "kimi";
  if (m == MODE_NET) return "net";
  if (m == MODE_MUSIC) return "music";
  if (m == MODE_BTC) return "btc";
  return "auto";
}

const char *activeAppName(ActiveApp app) {
  if (app == APP_CLAUDE) return "claude";
  if (app == APP_CODEX) return "codex";
  if (app == APP_GROK) return "grok";
  return "kimi";
}

void handleApiInfo() {
  JsonDocument doc;
  doc["ip"] = WiFi.localIP().toString();
  doc["ssid"] = WiFi.SSID();
  doc["bridge"] = bridgeHost;
  doc["mode"] = displayModeName(displayMode);           // configured mode
  doc["effective"] = displayModeName(effectiveMode());   // what's on screen now
  doc["music_playing"] = statusMusicPlaying;
  doc["showing"] = activeAppName(currentApp);
  doc["last_update_s"] = everPolled ? (long)((millis() - lastSuccessMs) / 1000) : -1;
  doc["sprite_rev"] = spriteRev;
  doc["brightness"] = brightness;
  doc["pet_preset"] = petPresetName();
  doc["pet_scale"] = petScale;
  doc["sprite_w"] = appSpriteW(currentApp);
  doc["sprite_h"] = appSpriteH(currentApp);
  doc["sprite_display_w"] = scaledPetSize(appSpriteW(currentApp));
  doc["sprite_display_h"] = scaledPetSize(appSpriteH(currentApp));
  doc["sprite_custom"] = appUsesCustom(currentApp);
  doc["wired"] = wiredActive(); // true = data currently arrives over USB serial
  doc["fw"] = FW_VERSION;
  JsonObject c = doc["claude"].to<JsonObject>();
  c["status"] = claudeStatus.status;
  c["custom_sprite"] = claudeCustom;
  c["w"] = appSpriteW(APP_CLAUDE);
  c["h"] = appSpriteH(APP_CLAUDE);
  c["display_w"] = scaledPetSize(appSpriteW(APP_CLAUDE));
  c["display_h"] = scaledPetSize(appSpriteH(APP_CLAUDE));
  JsonObject x = doc["codex"].to<JsonObject>();
  x["status"] = codexStatus.status;
  x["custom_sprite"] = codexCustom;
  x["w"] = appSpriteW(APP_CODEX);
  x["h"] = appSpriteH(APP_CODEX);
  x["display_w"] = scaledPetSize(appSpriteW(APP_CODEX));
  x["display_h"] = scaledPetSize(appSpriteH(APP_CODEX));
  String out;
  serializeJson(doc, out);
  webServer.send(200, "application/json", out);
}

void handleApiDisplay() {
  String mode = webServer.arg("mode");
  if (mode == "auto") displayMode = MODE_AUTO;
  else if (mode == "claude") displayMode = MODE_CLAUDE;
  else if (mode == "codex") displayMode = MODE_CODEX;
  else if (mode == "grok") displayMode = MODE_GROK;
  else if (mode == "kimi") displayMode = MODE_KIMI;
  else if (mode == "net") displayMode = MODE_NET;
  else if (mode == "music") displayMode = MODE_MUSIC;
  else if (mode == "btc") displayMode = MODE_BTC;
  else {
    webServer.send(400, "text/plain", "mode must be auto|claude|codex|grok|kimi|net|music|btc");
    return;
  }
  Serial.printf("[api] display mode = %s\n", mode.c_str());
  if (displayMode == MODE_NET) {
    netChromeDrawn = false;
    lastNetPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_MUSIC) {
    musicChromeDrawn = false;
    lastMusicPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_BTC) {
    lastBtcPollMs = 0;
  } else {
    updateActiveApp();
    drawActiveApp(); // unconditional: also repaints over a previous net chart
  }
  webServer.send(200, "text/plain", "ok");
}

void handleApiBrightness() {
  String levelArg = webServer.arg("level");
  if (levelArg.length() == 0) {
    webServer.send(400, "text/plain", "missing level (0-100)");
    return;
  }
  int level = levelArg.toInt();
  if (level < 0) level = 0;
  if (level > 100) level = 100;
  brightness = level;
  applyBrightness();
  saveBrightness();
  Serial.printf("[api] brightness = %d\n", brightness);
  webServer.send(200, "text/plain", "ok");
}

void handleApiPet() {
  String preset = webServer.arg("preset");
  String scaleArg = webServer.arg("scale");
  if (preset.length() > 0) {
    if (preset == "classic") petPreset = PET_CLASSIC;
    else if (preset == "border-collie") petPreset = PET_BORDER_COLLIE;
    else if (preset == "custom" && (claudeCustom || codexCustom)) petPreset = PET_CUSTOM;
    else {
      webServer.send(400, "text/plain", "preset must be classic|border-collie|custom (custom requires an upload)");
      return;
    }
  }
  if (scaleArg.length() > 0) petScale = constrain(scaleArg.toInt(), 60, 100);
  savePetAppearance();
  spriteRev++;
  claudeFrame = codexFrame = 0;
  if (mainUiShown && effectiveMode() != MODE_NET && effectiveMode() != MODE_MUSIC &&
      effectiveMode() != MODE_BTC) drawActiveApp();
  Serial.printf("[api] pet preset=%s scale=%d\n", petPresetName(), petScale);
  webServer.send(200, "text/plain", "ok");
}

