WhiteBalance2800K/esp32ai/firmware/src/main.cpp
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString("WiFi connected", 8, 70, 2);
    tft.drawString("Admin page:", 8, 100, 2);
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.drawString("http://" + WiFi.localIP().toString(), 8, 125, 2);
    delay(3000);

    showMainUiIfNeeded();
    pollBridge();
  }
  // else: the config-portal screen stays up; either the user configures WiFi
  // (handled in loop) or serial #STATUS frames arrive and take the screen over
}

void loop() {
  wifiManager.process(); // keeps the config portal alive until WiFi is set up
  maintainWiFi();        // recover a dropped STA link without losing USB mode
  pumpSerial();          // wired (USB) bridge frames

  if (!webServerStarted && WiFi.status() == WL_CONNECTED) {
    // WiFi came up after boot (portal or slow AP); the portal has released
    // port 80 by now, so the admin server can bind it
    setupWebServer();
    webServerStarted = true;
    showMainUiIfNeeded();
    lastPollMs = 0; // poll the bridge right away
  }
  if (webServerStarted) webServer.handleClient();
  if (!mainUiShown) return; // config-portal screen is up, nothing to animate

  unsigned long nowMs = millis();

  // Effective mode may differ from the configured one (AUTO -> music while
  // audio plays). On a transition, reset the incoming mode's chrome so it
  // repaints cleanly, and repaint the pet immediately when returning to it.
  DisplayMode eff = effectiveMode();
  if (eff != lastEffectiveMode) {
    lastEffectiveMode = eff;
    if (eff == MODE_NET) {
      netChromeDrawn = false;
      lastNetPollMs = 0;
    } else if (eff == MODE_MUSIC) {
      musicChromeDrawn = false;
      lastMusicPollMs = 0;
    } else if (eff == MODE_BTC) {
      lastBtcPollMs = 0;
    } else {
      updateActiveApp();
      drawActiveApp();
    }
  }

  if (ludicrousActive) {
    if (eff == MODE_NET || eff == MODE_MUSIC || eff == MODE_BTC ||
        eff == MODE_GROK || eff == MODE_KIMI || bridgeStale()
        || claudeStatus.needsInput || codexStatus.needsInput) {
      ludicrousActive = false;
      claudeLudicrousPending = codexLudicrousPending = false;
      if (eff == MODE_AUTO || eff == MODE_CLAUDE || eff == MODE_CODEX ||
          eff == MODE_GROK || eff == MODE_KIMI) drawActiveApp();
    } else if (nowMs - ludicrousStartMs >= 2400) {
      ludicrousActive = false;
      drawActiveApp();
      startPendingLudicrous();
    } else if (nowMs - lastLudicrousFrameMs >= 80) {
      lastLudicrousFrameMs = nowMs;
      drawLudicrousFrame((nowMs - ludicrousStartMs) / 2400.0f);
    }
  } else if (eff == MODE_NET) {
    // net-speed mode: rendering (constant-rate sweep) is independent of the
    // bridge polls that refill its sample queue
    if (nowMs - lastNetDrawMs >= NET_DRAW_INTERVAL_MS) {
      lastNetDrawMs = nowMs;
      netDrawTick();
    }
    if (nowMs - lastNetPollMs >= NET_POLL_INTERVAL_MS) {
      lastNetPollMs = nowMs;
      pollNet();
    }
  } else if (eff == MODE_MUSIC) {
    // music now-playing mode: cover art + track metadata from the bridge
    if (nowMs - lastMusicPollMs >= MUSIC_POLL_INTERVAL_MS) {
      lastMusicPollMs = nowMs;
      pollMusic();
    }
  } else if (eff == MODE_BTC) {
    if (nowMs - lastBtcPollMs >= BTC_POLL_INTERVAL_MS || lastBtcPollMs == 0) {
      lastBtcPollMs = nowMs;
      pollBtc();
    }
  } else {
    // sprite walk-cycle animation (only advances while that app is showing)
    if (nowMs - lastAnimMs >= ANIM_INTERVAL_MS) {
      lastAnimMs = nowMs;
      bool claudeWorking = claudeStatus.status == "working";
      bool codexWorking = codexStatus.status == "working";
      if (showingCd != CD_NONE) {
        // countdown owns the center area: no sprite frames over it
      } else if (currentApp == APP_CLAUDE && claudeWorking) {
        claudeFrame = appHasIdleFrame(APP_CLAUDE)
                          ? 1 + (claudeFrame % max(1, claudeFrameCount() - 1))
                          : (claudeFrame + 1) % claudeFrameCount();
        drawClaudeSprite(claudeFrame);
      } else if (currentApp == APP_CODEX && codexWorking) {
        // The built-in Codex animation reserves frame 0 for the idle Zen
        // pose. Working tasks loop only over the six left-running frames.
        // User-uploaded GIFs keep their historical all-frame loop behavior.
        codexFrame = appHasIdleFrame(APP_CODEX)
                         ? 1 + (codexFrame % max(1, codexFrameCount() - 1))
                         : (codexFrame + 1) % codexFrameCount();
        drawCodexSprite(codexFrame);
      } else if (currentApp == APP_CLAUDE && appHasIdleFrame(APP_CLAUDE) && claudeFrame != 0) {
        claudeFrame = 0;
        drawClaudeSprite(claudeFrame);
      } else if (currentApp == APP_CODEX && appHasIdleFrame(APP_CODEX) && codexFrame != 0) {
        codexFrame = 0;
        drawCodexSprite(codexFrame);
      }
    }

    // countdown seconds tick locally between bridge polls
    static unsigned long lastCdTickMs = 0;
    if (showingCd != CD_NONE && nowMs - lastCdTickMs >= 1000) {
      lastCdTickMs = nowMs;
      drawCountdown(false);
    }

    // "urgent" flash toggle (independent, faster cadence)
    if (nowMs - lastFlashMs >= FLASH_INTERVAL_MS) {
      lastFlashMs = nowMs;
      flashOn = !flashOn;
      if (bridgeStale()) {
        redrawRingOnly();
      } else if (currentAppNeedsInput()) {
        // approval needed: blink the whole border red, restore the quota ring
        // on the off-phase so it doesn't erase the normal chrome permanently
        if (flashOn) drawFullBorder(TFT_RED);
        else redrawRingOnly();
      }
    }

    // alternate which app is shown when neither/both are uniquely working
    if (updateActiveApp()) {
      drawActiveApp();
    }
  }

  // status poll continues in every mode (feeds /api/info and the web page).
  // Wired-first: while serial frames are flowing, skip HTTP polling entirely
  // (works around AP client isolation, and avoids double updates).
  if (nowMs - lastPollMs >= BRIDGE_POLL_INTERVAL_MS) {
    lastPollMs = nowMs;
    if (!wiredActive()) pollBridge();
  }
}
